CS132-F23/index.org
#+title: CAS CS 132
#+BEGIN_EXPORT html
  <header>
    <h1 class="titlehead">CAS CS 132</h1>
    <p class="subhead">Geometric Algorithms</p>
    <p class="subhead">Boston University</p>
    <p class="subhead">Fall 2023</p>
  </header>
#+END_EXPORT
This course is an introduction to linear algebra with a bent towards
applications in computer science. One of its primary goals is to
prepare students for courses in the CS cirriculum at BU which require
some degree of linear algebra. It is based on (and depends heavily on
the material of) the version of the course taught by [[https://www.cs.bu.edu/fac/crovella/][Mark Crovella]].
** Pages
+ [[file:info.org][Information]]
+ [[file:policies.org][Policies and Guidelines]]
+ [[file:schedule.org][Schedule]]
+ [[file:material.org][Schedule + Material]]
** Links
+ [[https://piazza.com/class/lln46z61vsx7km][Piazza]]
+ [[https://www.gradescope.com/courses/584313][Gradescope]]
+ [[http://mcrovella.github.io/CS132-Geometric-Algorithms/landing-page.html][Online Text]]
+ [[https://www.bu.edu/academics/cas/courses/cas-cs-132/][Registrar Page]]
  + see for up-to-date locations and times
+ [[file:index.org][Office Hours Calendar]]
+ Programming:
  + [[https://www.python.org][python]]
  + [[https://numpy.org][numpy]]
  + [[https://scipy.org][scipy]]
  + [[https://matplotlib.org][matplotlib]]
  + [[https://jupyter.org][jupyter]] (optional)
** Minutiae
+ Lecture Location: CAS B12
+ Lecture Times:
  + TR 3:30-4:45PM (B1)
  + TR 5:00-6:15PM (A1)
+ Grading:
  + *50%* Homework (top 10 of 12 scores)
  + *20%* Midterm Exam
  + *25%* Final Exam
  + *05%* Participation
** Course Staff
+ Instructor: [[https://nmmull.github.io][Nathan Mull]]
+ Teaching Fellows:
  + [[https://rahulmitra.xyz][Rahul Mitra]]
  + Ryan Yu
+ Teaching Assistants:
  + Vishesh Jain
  + Jincheng Zhang
+ Course Assistants:
  + Reshab Chhabra
  + Rachel Du
  + Yi Du
  + Eugene Jung
  + Chris Min
  + Ieva Sagaitis
  + Aparna Singh
  + Kevin Wrenn
** Log
*2023-08-25* /*!!! IMPORTANT !!!*/ If you require disability accomodations,
please talk to me as soon as possible

*2023-08-25* Site is live
