CS132-F23/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-23 Sat 17:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CAS CS 132</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="courseStyle.css">
</head>
<body>
<div id="org-div-home-and-up">⟨ <a href="index.html">home</a> ⟩</div><div id="content" class="content">
<h1 class="title">CAS CS 132
<br />
<span class="subtitle">Geometric Algorithms<br> Boston University<br> Fall 2023</span>
</h1>
<p>
This course is an introduction to linear algebra with a bent towards
applications in computer science. One of its primary goals is to
prepare students for courses in the CS cirriculum at BU which require
some degree of linear algebra. It is based on (and depends heavily on
the material of) the version of the course taught by <a href="https://www.cs.bu.edu/fac/crovella/">Mark Crovella</a>.
</p>
<div id="outline-container-org7f6c6f0" class="outline-2">
<h2 id="org7f6c6f0">Pages</h2>
<div class="outline-text-2" id="text-org7f6c6f0">
</div>
<ul class="org-ul">
<li><a id="orgaca44a0"></a><a href="info.html">Information</a><br /></li>
<li><a id="org2b9069c"></a><a href="policies.html">Policies and Guidelines</a><br /></li>
<li><a id="org1d6a50e"></a><a href="schedule.html">Schedule</a><br /></li>
<li><a id="org4ab65a2"></a><a href="schedule-material.html">Schedule + Material</a><br /></li>
<li><a id="org2351efa"></a><a href="material.html">Material</a><br /></li>
</ul>
</div>
<div id="outline-container-orga67f923" class="outline-2">
<h2 id="orga67f923">Links</h2>
<div class="outline-text-2" id="text-orga67f923">
</div>
<ul class="org-ul">
<li><a id="orgdd735a2"></a><a href="https://piazza.com/class/lln46z61vsx7km">Piazza</a><br /></li>
<li><a id="org3d7fda3"></a><a href="https://www.gradescope.com/courses/584313">Gradescope</a><br /></li>
<li><a id="orgc8fdf45"></a><a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/landing-page.html">Online Text</a><br /></li>
<li><a id="org2187bae"></a><a href="https://www.bu.edu/academics/cas/courses/cas-cs-132/">Registrar Page</a><br />
<ul class="org-ul">
<li><a id="orgc504237"></a>see for up-to-date locations and times<br /></li>
</ul>
</li>
<li><a id="orgeb1ae80"></a><a href="https://calendar.google.com/calendar/u/0/embed?src=c_117ca65747f38ed9a0282cd11a933bbb3aa5c1500a74b74a54e3e5a3e5520df8@group.calendar.google.com&amp;ctz=America/New_York">Office Hours Calendar</a><br /></li>
<li><a id="org4e34ac3"></a>Programming:<br />
<ul class="org-ul">
<li><a id="org3991671"></a><a href="https://www.python.org">python</a><br /></li>
<li><a id="orgf143606"></a><a href="https://numpy.org">numpy</a><br /></li>
<li><a id="orge69a022"></a><a href="https://scipy.org">scipy</a><br /></li>
<li><a id="org02c5a41"></a><a href="https://matplotlib.org">matplotlib</a><br /></li>
<li><a id="org694c884"></a><a href="https://jupyter.org">jupyter</a> (optional)<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org3af0a11" class="outline-2">
<h2 id="org3af0a11">Minutiae</h2>
<div class="outline-text-2" id="text-org3af0a11">
</div>
<ul class="org-ul">
<li><a id="orgc15a7a2"></a>Lecture Location: CAS B12<br /></li>
<li><a id="org22b163b"></a>Lecture Times:<br />
<ul class="org-ul">
<li><a id="org03495f5"></a>TR 3:30-4:45PM (B1)<br /></li>
<li><a id="org01d99a7"></a>TR 5:00-6:15PM (A1)<br /></li>
</ul>
</li>
<li><a id="org9d60bd5"></a>Grading:<br />
<ul class="org-ul">
<li><a id="org94b7ce4"></a><b>50%</b> Homework (top 10 of 12 scores)<br /></li>
<li><a id="org2f1ce77"></a><b>20%</b> Midterm Exam<br /></li>
<li><a id="orgb1f0f70"></a><b>25%</b> Final Exam<br /></li>
<li><a id="org79f68da"></a><b>05%</b> Participation<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org326c99a" class="outline-2">
<h2 id="org326c99a">Course Staff</h2>
<div class="outline-text-2" id="text-org326c99a">
</div>
<ul class="org-ul">
<li><a id="org62b05cd"></a>Instructor: <a href="https://nmmull.github.io">Nathan Mull</a><br /></li>
<li><a id="org4fcaaa6"></a>Teaching Fellows:<br />
<ul class="org-ul">
<li><a id="org6f50615"></a><a href="https://rahulmitra.xyz">Rahul Mitra</a><br /></li>
<li><a id="org1900fbe"></a>Ryan Yu<br /></li>
</ul>
</li>
<li><a id="orgaf63e72"></a>Teaching Assistants:<br />
<ul class="org-ul">
<li><a id="orgde63421"></a>Vishesh Jain<br /></li>
<li><a id="orgcb53c8e"></a>Jincheng Zhang<br /></li>
</ul>
</li>
<li><a id="orgd97e8e5"></a>Course Assistants:<br />
<ul class="org-ul">
<li><a id="org89afd2d"></a>Reshab Chhabra<br /></li>
<li><a id="orgf1f1eff"></a>Rachel Du<br /></li>
<li><a id="org61c677a"></a>Yi Du<br /></li>
<li><a id="org041c0ee"></a>Eugene Jung<br /></li>
<li><a id="orgc56ec71"></a>Chris Min<br /></li>
<li><a id="org31f9439"></a>Ieva Sagaitis<br /></li>
<li><a id="org034e4ba"></a>Aparna Singh<br /></li>
<li><a id="org2712bb3"></a>Kevin Wrenn<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orga67d984" class="outline-2">
<h2 id="orga67d984">Log</h2>
<div class="outline-text-2" id="text-orga67d984">
<p>
<b>2023-08-25</b> <i><b>!!! IMPORTANT !!!</b></i> If you require disability accomodations,
please talk to me as soon as possible
</p>

<p>
<b>2023-08-25</b> Site is live
</p>
</div>
</div>
</div>
</body>
</html>